app/Controllers/Master/EvaluasiTender.php

   public function show($id)
{
    $evaluasi = $this->evaluasiModel->getByIdWithJoin($id);

    if (!$evaluasi) {
        return redirect()->back()->with('error', 'Data evaluasi tidak ditemukan');
    }

    $pengajuanList = $this->pengajuanModel
        ->select('pengajuan_tender.pengajuan_id, vendor.nama_vendor, tender.nama_tender')
        ->join('vendor', 'vendor.vendor_id = pengajuan_tender.vendor_id')
        ->join('tender', 'tender.tender_id = pengajuan_tender.tender_id')
        ->findAll();
---
SELECT `pengajuan_tender`.`pengajuan_id`, `vendor`.`nama_vendor`, `tender`.`nama_tender`
FROM `pengajuan_tender`
JOIN `vendor` ON `vendor`.`vendor_id` = `pengajuan_tender`.`vendor_id`
JOIN `tender` ON `tender`.`tender_id` = `pengajuan_tender`.`tender_id`