app/Controllers/Master/KategoriTender.php

SELECT *
FROM `kategori_tender`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `kategori_tender`
---
    public function index()
    {
        $kategoriModel = new KategoriTenderModel();
        $search = $this->request->getGet('search');

        if ($search) {
            $kategoriModel->like('nama_kategori', $search);
        }

        $data['kategori_tenders'] = $kategoriModel->paginate(10);

INSERT INTO `kategori_tender` (`nama_kategori`, `created_at`, `updated_at`) VALUES ('makanan', '2025-06-22 13:02:41', '2025-06-22 13:02:41')
---
    public function store()
    {
        $kategoriModel = new KategoriTenderModel();

        $data = [
            'nama_kategori' => $this->request->getPost('nama_kategori'),
            'created_at'    => date('Y-m-d H:i:s'),
            'updated_at'    => date('Y-m-d H:i:s'),
        ];

        $kategoriModel->insert($data);

SELECT *
FROM `kategori_tender`
WHERE `kategori_tender`.`kategori_id` = '4'
---
    public function edit($id)
    {
        $kategoriModel = new KategoriTenderModel();
        $data['kategori'] = $kategoriModel->find($id);

DELETE FROM `kategori_tender`
WHERE `kategori_id` IN ('4')
---
    public function delete($id)
    {
        $kategoriModel = new KategoriTenderModel();
        $kategoriModel->delete($id);