app/Controllers/Master/SertifikasiTender.php

    public function index()
    {
        $model = new SertifikasiTenderModel();
        $search = $this->request->getGet('search');

        if ($search) {
            $model->like('nama_sertifikat', $search);
        }

        $data['sertifikasi'] = $model->select('sertifikasi_tender.*, tender.nama_tender')
                                     ->join('tender', 'tender.tender_id = sertifikasi_tender.tender_id', 'left')
                                     ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `sertifikasi_tender`
LEFT JOIN `tender` ON `tender`.`tender_id` = `sertifikasi_tender`.`tender_id`
SELECT `sertifikasi_tender`.*, `tender`.`nama_tender`
FROM `sertifikasi_tender`
LEFT JOIN `tender` ON `tender`.`tender_id` = `sertifikasi_tender`.`tender_id`
 LIMIT 10