app/Controllers/Master/TenderController.php

    public function index()
{
    $vendorModel = new TenderModel();
    // Ambil kata kunci pencarian jika ada
    $search = $this->request->getGet('search');

    $tenderModel = new TenderModel();

    if ($search) {
        $tenderModel->like('nama_tender', $search);
    }

    // Ambil data tender dengan pagination (10 per halaman)
    $data['tenders'] = $tenderModel->paginate(10);
---
SELECT *
FROM `tender`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tender`

    public function delete($id)
    {
        $tenderModel = new TenderModel();
        $tenderModel->delete($id);
---
DELETE FROM `tender`
WHERE `tender_id` IN ('1')