app/Controllers/Master/VendorController.php

    public function index()
{
    $vendorModel = new VendorModel();

    // Ambil kata kunci pencarian jika ada
    $search = $this->request->getGet('search');

    if ($search) {
        $vendorModel->like('nama_vendor', $search);
    }

    // Ambil data vendor dengan pagination (10 per halaman)
    $data['vendors'] = $vendorModel->paginate(10);
---
SELECT *
FROM `vendor`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `vendor`

    public function store()
    {
        // Logic to store vendor data
        $vendorModel = new VendorModel();

        // Get input data from request
        $data = [
            'nama_vendor' => $this->request->getPost('nama_vendor'),
            'alamat'      => $this->request->getPost('alamat'),
            // Tambahkan field lain sesuai kebutuhan
        ];

        // Simpan data ke database
        $vendorModel->insert($data);
        return redirect()->to('/vendor')->with('success', 'Vendor created successfully!');
---
SELECT *
FROM `vendor`
WHERE `vendor`.`vendor_id` = '2'

    public function delete($id)
    {
        // Logic to delete vendor data by ID
        $vendorModel = new VendorModel();
        $vendor = $vendorModel->find($id);
        if (!$vendor) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Vendor not found');
        }
        $vendorModel->delete($id);
---
SELECT *
FROM `vendor`
WHERE `vendor`.`vendor_id` = '5'
DELETE FROM `vendor`
WHERE `vendor_id` IN ('5')