app/Controllers/PengajuanTenderController.php

SELECT *
FROM `vendor`
SELECT *
FROM `tender`
---
    public function create()
{
    $vendor = $this->vendorModel->findAll();
    $tender = $this->tenderModel->findAll();