app/Models/EvaluasiTenderModel.php

    public function getFullEvaluasiQuery()
    {
        return $this->select('
                evaluasi_tender.*,
                pengajuan_tender.tanggal_pengajuan,
                pengajuan_tender.status AS status_pengajuan,
                vendor.nama_vendor,
                tender.nama_tender,
                tender.instansi
            ')
            ->join('pengajuan_tender', 'pengajuan_tender.pengajuan_id = evaluasi_tender.pengajuan_id')
            ->join('vendor', 'vendor.vendor_id = pengajuan_tender.vendor_id')
            ->join('tender', 'tender.tender_id = pengajuan_tender.tender_id');
---
SELECT `evaluasi_tender`.*, `pengajuan_tender`.`tanggal_pengajuan`, `pengajuan_tender`.`status` AS `status_pengajuan`, `vendor`.`nama_vendor`, `tender`.`nama_tender`, `tender`.`instansi`
FROM `evaluasi_tender`
JOIN `pengajuan_tender` ON `pengajuan_tender`.`pengajuan_id` = `evaluasi_tender`.`pengajuan_id`
JOIN `vendor` ON `vendor`.`vendor_id` = `pengajuan_tender`.`vendor_id`
JOIN `tender` ON `tender`.`tender_id` = `pengajuan_tender`.`tender_id`