app/Models/PengajuanTenderModel.php

    public function getWithJoins($id = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('
            pengajuan_tender.*,
            vendor.nama_vendor,
            tender.nama_tender
        ');
        $builder->join('vendor', 'vendor.vendor_id = pengajuan_tender.vendor_id');
        $builder->join('tender', 'tender.tender_id = pengajuan_tender.tender_id');

        if ($id !== null) {
            $builder->where('pengajuan_tender.pengajuan_id', $id);
            return $builder->get()->getRowArray();
        }

        return $builder->get()->getResultArray();
---
SELECT `pengajuan_tender`.*, `vendor`.`nama_vendor`, `tender`.`nama_tender`
FROM `pengajuan_tender`
JOIN `vendor` ON `vendor`.`vendor_id` = `pengajuan_tender`.`vendor_id`
JOIN `tender` ON `tender`.`tender_id` = `pengajuan_tender`.`tender_id`